davidlaone/AfridevV2-Firmware/AfridevV2_MSP430/src/outpour.h
// Give names to the various port pin numbers
#define VBAT_GND BIT1		 // Pin 1.1, Output
#define GSM_DCDC BIT2		 // Pin 1.2, Output
#define _1V8_EN BIT3		 // Pin 1.3, Output
#define GSM_INT BIT4		 // Pin 1.4, Input
#define GSM_STATUS BIT5		 // Pin 1.5, Input
#define TM_GPS BIT6          // Pin 1.6, Input
#define GPS_ON_IND BIT7      // Pin 1.7, Input

#define VBAT_MON BIT0		 // Pin 2.0, ADC
#define I2C_DRV BIT3		 // Pin 2.3, Output
#define GSM_EN BIT4			 // Pin 2.4, Output
#define LS_VCC BIT5          // Pin 2.5, Output

#define I2C_SDA BIT1		 // Pin 3.1, Not Used
#define I2C_SCL BIT2		 // Pin 3.2, Not Used
#define NTC_ENABLE BIT3      // Pin 3.3, Output
#define TXD BIT4			 // Pin 3.4, UART
#define RXD BIT5			 // Pin 3.5, UART
#define MSP_UART_SEL BIT7    // Pin 3.7, UART Select (Modem or GPS)

#define GPS_ON_OFF BIT2		 // Pin 4.2, Output
#define NTC_SENSE_INPUT BIT3 // Pin 4.3, ADC

#define MODEM_UART_SELECT_ENABLE() (P3OUT &= ~MSP_UART_SEL)
#define GPS_UART_SELECT_ENABLE() (P3OUT |= MSP_UART_SEL)

/*******************************************************************************
*  Centralized method for enabling and disabling MSP430 interrupts
*******************************************************************************/
static inline void enableGlobalInterrupt(void) {
    _BIS_SR(GIE);
}
static inline void disableGlobalInterrupt(void) {
    _BIC_SR(GIE);
}
static inline void enableSysTimerInterrupt(void) {
    TA1CCTL0 |= CCIE;
}
static inline void disableSysTimerInterrupt(void) {
    TA1CCTL0 &= ~CCIE;
}
static inline void restoreSysTimerInterrupt(uint16_t val) {
    TA1CCTL0 &= ~CCIE; // clear the value
    TA1CCTL0 |= val;   // set to val
}
static inline uint16_t getAndDisableSysTimerInterrupt(void) {
    volatile uint16_t current = TA1CCTL0; // read reg
    current  &= CCIE;  // get current interrupt setting
    TA1CCTL0 &= ~CCIE; // disable interrupt
    return current;    // return interrupt setting
}

// #define USE_UART_SIGNALS_FOR_GPIO
#ifdef USE_UART_SIGNALS_FOR_GPIO
static inline void setDebug0(void) {
    P3OUT |= TXD;
}
static inline void clearDebug0(void) {
    P3OUT &= ~TXD;
}
static inline void setDebug1(void) {
    P3OUT |= RXD;
}
static inline void clearDebug1(void) {
    P3OUT &= ~RXD;
}
#endif

/*******************************************************************************
*  Polling Delays
*******************************************************************************/
void secDelay(uint8_t secCount);
void ms1Delay(uint8_t msCount);
void us10Delay(uint8_t us10);

/*******************************************************************************
* sysExec.c
*******************************************************************************/
/**
 * \def REBOOT_KEY1
 * \def REBOOT_KEY2
 * \def REBOOT_KEY3
 * \def REBOOT_KEY4
 * \brief These keys are used to validate the OTA reset command.
 */
#define REBOOT_KEY1 ((uint8_t)0xAA)
#define REBOOT_KEY2 ((uint8_t)0x55)
#define REBOOT_KEY3 ((uint8_t)0xCC)
#define REBOOT_KEY4 ((uint8_t)0x33)

void sysExec_exec(void);
bool sysExec_startRebootCountdown(uint8_t activateReboot);
void sysError(void);

/*******************************************************************************
* Utils.c
*******************************************************************************/
typedef struct timeCompare_s {
    uint8_t hoursA;
    uint8_t minutesA;
    uint8_t secondsA;
    uint8_t hoursB;
    uint8_t minutesB;
    uint8_t secondsB;
    uint32_t timeDiffInSeconds;
} timeCompare_t;

unsigned int gen_crc16(const unsigned char *data, unsigned int size);
unsigned int gen_crc16_2buf(const unsigned char *data1, unsigned int size1, const unsigned char *data2, unsigned int size2);
uint32_t timeInSeconds(uint8_t hours, uint8_t minutes, uint8_t seconds);
void calcTimeDiffInSeconds(timeCompare_t *timeCompareP);
void reverseEndian32(uint32_t *valP);
void reverseEndian16(uint16_t *valP);

/*******************************************************************************
* modemCmd.h
*******************************************************************************/

/**
 * \typedef modemCmdWriteData_t 
 * \brief Container to pass parmaters to the modem command write 
 *        function.
 */
typedef struct modemCmdWriteData_s {
    outpour_modem_command_t cmd; /**< the modem command */
    MessageType_t payloadMsgId;  /**< the payload type (Afridev message type) */
    uint8_t *payloadP;           /**< the payload pointer (if any) */
    uint16_t payloadLength;      /**< size of the payload in bytes */
    uint16_t payloadOffset;      /**< for receiving partial data */
    bool statusOnly;             /**< only perform status retrieve from modem - no cmd */
} modemCmdWriteData_t;

/**
 * \typedef modemCmdReadData_t 
 * \brief Container to read the raw response returned from the 
 *        modem as a result of sending it a command. 
 */
typedef struct modemCmdReadData_s {
    modem_command_t modemCmdId;    /**< the cmd we are sending to the modem */
    bool valid;                    /**< indicates that the response is correct (crc passed, etc) */
    uint8_t *dataP;                /**< the pointer to the raw buffer */
    uint16_t lengthInBytes;        /**< the length of the data in the buffer */
} modemCmdReadData_t;

/**
 * \def OTA_PAYLOAD_MAX_READ_LENGTH
 * \brief Specify the max length of space allowed in the RX ISR
 *        Buffer for OTA message payload data. This length is in
 *        addition to the message header overhead which is read
 *        into the RX ISR buffer as well. Note that this max
 *        length only applies to the data portion received via
 *        the M_COMMAND_GET_INCOMING_PARTIAL command from the
 *        Modem. If the OTA data length is larger than the
 *        allowed max length, than an iterative approach is used
 *        to read the data from the modem in chunks. The only
 *        case where the iterative approach is needed is for a
 *        firmware upgrade.  All other OTA payload data length
 *        is currently less than 16 bytes.
 */
#define OTA_PAYLOAD_MAX_RX_READ_LENGTH ((uint16_t)512)

/**
 * \def OTA_RESPONSE_LENGTH
 * \brief Specify the total size of an OTA response.  This is 
 *        the length of an OTA response message being sent to
 *        the cloud by the unit. It is a constant value. It
 *        consists of the header and the data.  The header is
 *        always 16 bytes and the data is always 32 bytes -
 *        regardless of whether it is all used by the message
 *        sent.  Example OTA Response messages include
 *        OTA_OPCODE_GMT_CLOCKSET, OTA_OPCODE_LOCAL_OFFSET, etc.
 * \note An OTA Response should not be confused with a data 
 *       message (also sent to the cloud). Data messages are not
 *       a constant length.  Examples include
 *       MSG_TYPE_DAILY_LOG, MSG_TYPE_CHECKIN, etc.
 */
#define OTA_RESPONSE_LENGTH (OTA_RESPONSE_HEADER_LENGTH+OTA_RESPONSE_DATA_LENGTH)

/**
 * \def OTA_RESPONSE_HEADER_LENGTH
 * \brief Define the header length of an OTA response message 
 */
#define OTA_RESPONSE_HEADER_LENGTH ((uint8_t)16)

/**
 * \def OTA_RESPONSE_DATA_LENGTH
 * \brief Define the data length of an OTA response message. The
 *        data follows the header in the message.
 */
#define OTA_RESPONSE_DATA_LENGTH ((uint8_t)32)

/**
 * \typedef otaResponse_t
 * \brief Define a container to hold a partial OTA response.
 */
typedef struct otaResponse_s {
    uint8_t *buf;                         /**< A buffer to hold one OTA message */
    uint16_t lengthInBytes;               /**< how much valid data is in the buf */
    uint16_t remainingInBytes;            /**< how much remaining of the total OTA */
}otaResponse_t;

void modemCmd_exec(void);
void modemCmd_init(void);
bool modemCmd_write(modemCmdWriteData_t *writeCmdP);
void modemCmd_read(modemCmdReadData_t *readDataP);
bool modemCmd_isResponseReady(void);
bool modemCmd_isError(void);
bool modemCmd_isBusy(void);
void modemCmd_isr(void);

