davidlaone/AfridevV2-Firmware/AfridevV2_MSP430/src/outpour.h
void dataMsgSm_init(void);
void dataMsgSm_initForNewSession(dataMsgSm_t *dataMsgP);
void dataMsgSm_sendAnotherDataMsg(dataMsgSm_t *dataMsgP);
void dataMsgSm_stateMachine(dataMsgSm_t *dataMsgP);

/*******************************************************************************
* time.c
*******************************************************************************/
/**
 * \typedef timePacket_t 
 * \brief Specify a structure to hold time data that will be 
 *        sent as part of the final assembly message.
 */
typedef struct  __attribute__((__packed__))timePacket_s {
    uint8_t second;
    uint8_t minute;
    uint8_t hour24;
    uint8_t day;
    uint8_t month;
    uint8_t year;
} timePacket_t;

void timerA0_init(void);
void getBinTime(timePacket_t *tpP);
uint8_t bcd_to_char(uint8_t bcdValue);
uint32_t getSecondsSinceBoot(void);

// Watchdog Macros
// 1 second time out, uses ACLK
#define WATCHDOG_TICKLE() (WDTCTL = WDT_ARST_1000)
#define WATCHDOG_STOP() (WDTCTL = (WDTPW | WDTHOLD))

// For testing, don't enable watchdog
// #define WATCHDOG_TICKLE() (WDTCTL = WDTPW | WDTHOLD)

/*******************************************************************************
* storage.c
*******************************************************************************/
void storageMgr_init(void);
void storageMgr_exec(uint16_t currentFlowRateInSecML);
void storageMgr_overrideUnitActivation(bool flag);
uint16_t storageMgr_getDaysActivated(void);
void storageMgr_resetRedFlag(void);
bool storageMgr_getRedFlagConditionStatus(void);
void storageMgr_resetRedFlagAndMap(void);
void storageMgr_resetWeeklyLogs(void);
void storageMgr_setStorageAlignmentTime(uint8_t alignSecond, uint8_t alignMinute, uint8_t alignHour24);
void storageMgr_setTransmissionRate(uint8_t transmissionRateInDays);
uint16_t storageMgr_getNextDailyLogToTransmit(uint8_t **dataPP);
void storageMgr_sendDebugDataToUart(void);
uint8_t storageMgr_getStorageClockInfo(uint8_t *bufP);
uint8_t storageMgr_getStorageClockHour(void);
uint8_t storageMgr_getStorageClockMinute(void);
uint8_t storageMgr_prepareMsgHeader(uint8_t *dataPtr, uint8_t payloadMsgId);
uint16_t storageMgr_getMonthlyCheckinMessage(uint8_t **payloadPP);
uint16_t storageMgr_getActivatedMessage(uint8_t **payloadPP);

/*******************************************************************************
* waterSense.c
*******************************************************************************/
void waterSense_init(void);
void waterSense_exec(void);
bool waterSense_isInstalled(void);
uint16_t waterSense_getLastMeasFlowRateInML(void);
void waterSense_clearStats(void);
uint16_t waterSense_getPadStatsMax(padId_t padId);
uint16_t waterSense_padStatsMin(padId_t padId);
uint16_t waterSense_getPadStatsSubmerged(padId_t padId);
uint16_t waterSense_getPadStatsUnknowns(void);
uint16_t padStats_zeros(void);
int16_t waterSense_getTempCelcius(void);
void waterSense_writeConstants(uint8_t *dataP);
void waterSense_sendDebugDataToUart(void);

/*******************************************************************************
* hal.c
*******************************************************************************/
void hal_sysClockInit(void);
void hal_uartInit(void);
void hal_pinInit(void);

/*******************************************************************************
* flash.c
*******************************************************************************/
void msp430Flash_erase_segment(uint8_t *flashSectorAddrP);
void msp430Flash_write_bytes(uint8_t *flashP, uint8_t *srcP, uint16_t num_bytes);
void msp430Flash_write_int16(uint8_t *flashP, uint16_t val16);
void msp430Flash_write_int32(uint8_t *flashP, uint32_t val32);

/*******************************************************************************
* For Firmware Upgrade Support
*******************************************************************************/
/**
 * \def FLASH_UPGRADE_KEY1
 * \def FLASH_UPGRADE_KEY2
 * \def FLASH_UPGRADE_KEY3
 * \def FLASH_UPGRADE_KEY4
 * \brief These keys are used to validate the OTA firmware
 *        upgrade command.
 */
#define FLASH_UPGRADE_KEY1 ((uint8_t)0x31)
#define FLASH_UPGRADE_KEY2 ((uint8_t)0x41)
#define FLASH_UPGRADE_KEY3 ((uint8_t)0x59)
#define FLASH_UPGRADE_KEY4 ((uint8_t)0x26)

/*******************************************************************************
* appRecord.c
*******************************************************************************/
bool appRecord_initAppRecord(void);
bool appRecord_checkForValidAppRecord(void);
bool appRecord_checkForNewFirmware(void);
bool appRecord_updateFwInfo(bool newFwIsReady, uint16_t newFwCrc);
bool appRecord_getNewFirmwareInfo(bool *newFwReadyP, uint16_t *newFwCrcP);
void appRecord_erase();
#if 0
void appRecord_test(void);
#endif

/*******************************************************************************
* MsgSchedule.c 
*******************************************************************************/
void msgSched_init(void);
void msgSched_exec(void);
void msgSched_scheduleDailyWaterLogMessage(void);
void msgSched_scheduleActivatedMessage(void);
void msgSched_scheduleMonthlyCheckInMessage(void);
void msgSched_scheduleGpsLocationMessage(void);
void msgSched_scheduleGpsMeasurement(void);
void msgSched_getNextMessageToTransmit(modemCmdWriteData_t *cmdWriteP);

/*******************************************************************************
* gps.c 
*******************************************************************************/
void gps_init(void);
void gps_exec(void);
void gps_start(void);
void gps_stop(void);
bool gps_isActive(void);
uint16_t gps_getGpsMessage(uint8_t **payloadP);
uint16_t gps_getGpsData(uint8_t *bufP);

/*******************************************************************************
* gpsPower.c 
*******************************************************************************/
void gpsPower_exec(void);
void gpsPower_init(void);
void gpsPower_restart(void);
void gpsPower_powerDownGPS(void);
bool gpsPower_isGpsOn(void);
bool gpsPower_isGpsOnError(void);
uint16_t gpsPower_getGpsOnTimeInSecs(void);

/*******************************************************************************
* gpsMsg.c 
*******************************************************************************/

typedef struct __attribute__((__packed__))gpsReportData_s {
    uint8_t hours;
    uint8_t minutes;
    int32_t latitude;
    int32_t longitude;
    uint8_t fixQuality;
    uint8_t numOfSats;
    uint8_t hdop;
    uint8_t reserved;
    uint16_t fixTimeInSecs;
}gpsReportData_t;

void gpsMsg_init(void);
void gpsMsg_exec(void);
bool gpsMsg_start(void);
void gpsMsg_stop(void);
bool gpsMsg_isActive(void);
bool gpsMsg_isError(void);
bool gpsMsg_gotGgaMessage(void);
bool gpsMsg_gotValidGpsFix(void);
void gpsMsg_isr(void);
uint8_t gpsMsg_getGgaParsedData(uint8_t *bufP);
void gpsMsg_setMeasCriteria(uint8_t numSats, uint8_t hdop, uint16_t minMeasTime);

